## Handling missing data
## Date: 9/2/22

In [1]:
import numpy as np
import pandas as pd

In [3]:
#use pandas isnan() or isnull() funtion
x = pd.Series([1, np.nan, 3, 7, 3, np.nan, 6, 10, np.nan, np.nan])

In [12]:
#option1 is to use np.isnan()
print(np.isnan(x))
#option1 is to use pd.isnull(), both work the same way
print(pd.isnull(x))
#total number of null values
print(pd.isnull(x).sum())

0    False
1     True
2    False
3    False
4    False
5     True
6    False
7    False
8     True
9     True
dtype: bool
0    False
1     True
2    False
3    False
4    False
5     True
6    False
7    False
8     True
9     True
dtype: bool
4

In [13]:
#filter data
x[pd.notnull(x)]

0     1.0
2     3.0
3     7.0
4     3.0
6     6.0
7    10.0
dtype: float64

In [15]:
#simpler way, isnull() and notnull() are also normal python functions
x.isnull().sum()

4

In [17]:
#drop null values
y = x.dropna()
print(y)

0     1.0
2     3.0
3     7.0
4     3.0
6     6.0
7    10.0
dtype: float64

The same thinh works for pandas datafrmaes as well, ex: df.dropna(). An importnat difference is that dropna() will drop any rows that has a nul value. Ofc you can also change this to dropping columns by setting axis=1. You can also use 'threshold' in dropna(), which sets a threshold on the number of null values, beyond which the row or column is dropped

### Fixing null values

In [19]:
#fill missing values with mean of the array/series
x.fillna(x.mean())

0     1.0
1     5.0
2     3.0
3     7.0
4     3.0
5     5.0
6     6.0
7    10.0
8     5.0
9     5.0
dtype: float64

In [23]:
#fill missing values with forwadfill and backwardfill
print(x)
print(x.fillna(method='ffill'))
print(x.fillna(method='bfill'))

0     1.0
1     NaN
2     3.0
3     7.0
4     3.0
5     NaN
6     6.0
7    10.0
8     NaN
9     NaN
dtype: float64
0     1.0
1     1.0
2     3.0
3     7.0
4     3.0
5     3.0
6     6.0
7    10.0
8    10.0
9    10.0
dtype: float64
0     1.0
1     3.0
2     3.0
3     7.0
4     3.0
5     6.0
6     6.0
7    10.0
8     NaN
9     NaN
dtype: float64

Notice that the bfill method leaves the last two null values as is.

## Handling invalid data

In [26]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'M', 'R'],
    'Age': [34, 24, 35, 26, 219]
})
df

  Sex  Age
0   M   34
1   F   24
2   F   35
3   M   26
4   R  219

In [30]:
#check unique values
df.Sex.value_counts()
df.Age.unique()

array([ 34,  24,  35,  26, 219], dtype=int64)

In [31]:
#use replace method for Sex
df.replace('R', 'F')

  Sex  Age
0   M   34
1   F   24
2   F   35
3   M   26
4   F  219

In [37]:
#for age replace higher than 100 values with age/10
#note that these operations are immutable unless you assign it with a '='
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10
df

  Sex   Age
0   M  34.0
1   F  24.0
2   F  35.0
3   M  26.0
4   R  21.9

## Duplicate values

In [40]:
df1 = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])
df1

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [41]:
df1.duplicated()

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [46]:
#keep one of the duplicated values by using last or first
print(df1.drop_duplicates(keep='first'))
print(df1.drop_duplicates(keep='last'))
#drop all values that have duplicates
print(df1.drop_duplicates(keep=False))

Gérard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object
Gérard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object
Gérard Araud          France
Armando Varricchio     Italy
dtype: object

## Slitting columns in df

In [47]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [48]:
df.info()
#each column has a datatype and can be accessed through .str (for object or string)
# .dt (for datetime) and so on

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    5 non-null      object
dtypes: object(1)
memory usage: 168.0+ bytes

In [49]:
#this adds commas whereever there were _
df.Data.str.split('_')
#this replaces _ with a space
df.Data.str.replace('_', ' ')

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [54]:
#this creates splits with different columns
df1 = df.Data.str.split('_', expand=True)
df1

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [58]:
#assign new coumn names
df1.columns = ['Year', 'Sex', 'Country', 'num_of_cars']
df1
#replace the '?' with ''
df1.Year = df1.Year.str.replace('?', '')

C:\Users\user\AppData\Local\Temp/ipykernel_19324/162197704.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df1.Year = df1.Year.str.replace('?', '')

In [61]:
df1
#there is extra space in 'I T', so fixing that
#note: str.strip() will also do the same thing
df1.Country = df1.Country.str.replace(' ', '')
df1

   Year Sex Country num_of_cars
0  1987   M      US           1
1  1990   M      UK           1
2  1992   F      US           2
3  1970   M      IT           1
4  1985   F      IT           2

In [63]:
#also check contains()
df1.Country.str.contains('US')

0     True
1    False
2     True
3    False
4    False
Name: Country, dtype: bool